print('Шляпка гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... плёнкой. Когда её уберёшь, откроется нижняя ... сторона шляпк..')

a = str(input('Введите недостающее слово, Покрытая ... : '))
b = str(input('Введите слово с недостающей буквой, Кожиц..й: '))

c = str(input('Введит недостающее слово, держиится на ... : '))
d = str(input('Введите слово с недостающей буквой, ножк.. : ' ))

f = str(input('Введите недостающее слово, затянута ... : ' ))
g = str(input('Введите недостающее слово, нижняя ... :' ))

h = str(input('Введите слово с недостающей буквой, шляпк.. :' ))

print('Шляпка гриба, покрытая' + ' ' + a + ' ' + b + ' ' + ', держится на' + ' ' + c + ' ' + d + ' ' + '. Снизу шляпка затянута' + ' ' + f + ' плёнкой. Когда её уберёшь, откроется нижняя' + ' ' + g + ' ' + 'сторона' + ' ' + h)